---
kind: other
id: Methods.T:Autodesk.Revit.DB.TriangulatedSolidOrShell
source: html/d6f95271-c945-186c-53b4-79d4d21d149c.htm
---
# TriangulatedSolidOrShell Methods

Returns the specified shell component of a solid or shell. Input componentIndex must lie
 between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent
 should not be modified by the caller.